<h1>Benutzerinformationen</h1>
<p>
 &Uuml;ber die Namen von Personen kommt man auf deren Informationsseite.<br>
 Wenn die Person es will, werden hier Daten wie Geburtsdatum oder E-Mailadresse angezeigt. Ansonsten werden alle Gruppen aufgelistet, in denen eine Person Mitglied ist.<br>
 Das Briefsymbol hinter dem Namen f&uuml;hrt zum Erstellen einer pers&ouml;nlichen Nachricht.
</p>
<h3>Eigene Daten</h3>
<p>
 Benutzt man den Link zur eigenen Person oben rechts, hat man die M&ouml;glichkeit seine eigenen Daten zu ver&auml;ndern und andere Einstellungen vorzunehmen. Wenn man wissen will, wie andere Personen die eigene Seite sehen, w&auml;hlt man den eigenen Namen in einer Personenliste aus.
</p>

<h3>Pers&ouml;nliches Profil</h3>
<h4>Basisdaten</h4>
<p>Die Basisdaten sind Pflichtangaben und m&uuml;ssen eingegeben werden. Allerdings sind das Geburtsdatum und die E-Mailadresse nicht automatisch f&uuml;r andere Nutzer sichtbar. Sie dienen lediglich zur internen Verwaltung.</p>

<h4>Einstellungen</h4>
Mit den Einstellungen l&auml;sst sich das Verhalten von Infoschool auf die eigenen Bed&uuml;rfnisse anpassen:
<ul>
<li>Messages per Mail schicken: Diese Option bewirkt, dass alle Nachrichten, die man &uuml;ber die Messages-Funktion von Infoschool erh&auml;lt, an die angegebene E-Mailadresse geschickt und im System gleich als gelesen markiert werden.</li>
<li>Vertretungsplan per Mail schicken: Hierdurch wird bewirkt, dass der Vertretungsplan n&auml;chsten Tag um 18:00 per E-Mail verschickt wird, falls er vorhanden ist.</li>
<li>Inhalt auf 100% optimieren: Normalerweise passt Infoschool die Gr&ouml;&szlig;e des Inhalt-Bereichs auf den Inhalt an. Dadurch befindt sich das Navigationsmen&uuml; und die Logininformationen aber immer an unterschiedlichen Stellen. Wird der Inhalt auf 100% optimiert, nimmt der Inhalts-Bereich immer den maximal m&ouml;glichen Platz ein. Einige Browser haben mit dieser Darstellung allerdings Probleme.</li>
<li>Namensk&uuml;rzel: Diese Funktion erm&ouml;glicht Lehrern, dass die Informationen aus dem Vertretungsplan in den Kalender &uuml;bernommen werden k&ouml;nnen. Tragen Sie dazu bitte hier Ihr normales Namensk&uuml;rzel (das auch beim Stundenplan verwendet wird) ein.</li>
<li>Bildschirmschoner Wartezeit: Hiermit l&auml;sst sich einstellen, nach wievielen Minuten der Bildschirmschoner sich einstellt. Eine Zeit von 0 deaktiviert den Bildschirmschoner.</li>
<li>Bildschirmschoner Geschwindigkeit: Je nach Rechnergeschwindigkeit ist eine andere Geschwindigkeit des Bildschirmschoners sinnvoll. 10 ist am schnellsten, verbraucht jedoch auch die meisten Resourcen.</li>
</ul>

<h4>Steckbrief</h4>
<p>Diese Felder beeinflussen, welche Daten anderen, <b>angemeldeten</b> Nutzern &uuml;ber Sie zug&auml;nglich sind. Vergewissern Sie sich also, ob Sie diese Daten wirklich ver&ouml;ffentlich wollen!</p>

<h3>Avatar ver&ouml;ffentlichen</h3>
<p>Ein Avatar ist ein kleines Bild, dass in Ihrem Steckbrief angezeigt wird, d.h. es ist allen angemeldeten Nutzern zug&auml;nglich! Dies kann zum Beispiel ein Passfoto sein oder auch ein anderes Bild, mit dem Sie sich verbinden.<br>
Die Bilder m&uuml;ssen die angegeben Vorraussetzungen erf&uuml;llern um von Infoschool akzeptiert zu werden.</p>

<h3>Passwort &auml;ndern</h3>
<p>Hier haben Sie die M&ouml;glichkeit Ihr Passwort zu &auml;ndern. Aus Sicherheitsgr&uuml;nden m&uuml;ssen Sie es dazu zweimal eingeben, au&szlig;erdem ben&ouml;tigen Sie noch Ihr altes Passwort zur Best&auml;tigung.<br>
<b>Sie sollten Ihr Passwort regelm&auml;&szlig;ig &auml;ndern - m&ouml;glichst mehrmal im Jahr! Ein sicheres Passwort besteht aus Buchstaben, Zahlen und Sonderzeichen und ist mindestens 6 Zeichen lang. Nicht zu empfehlen sind W&ouml;rter, Namen, Geburtsdaten und &auml;hnliches. Achten Sie auch darauf, dass niemand Ihr Passwort erf&auml;hrt (z.B. durch Zettel auf dem Monitor)! Ansonsten kann sich diese Person mit Ihren Rechten und unter Ihrer Identit&auml;t bei Infoschool einloggen!<br>
Sollten Sie vermuten, dass jemand Ihren Account mi&szlig;braucht, wenden Sie sich bitte sofort an einen Administrator oder &auml;ndern Sie (sofern m&ouml;glich) Ihr Passwort.</b>
</p>
