<h1>News</h1>
<h3>Neuer Eintrag</h3>
<p>
 Auf der Seite "Neuer Eintrag" ist eine Eingabemaske mit der man News-Beitr&auml;ge erstellen kann. Die selbe Maske wird auch zum editieren angezeigt. Sie bietet folgende Eingabem&ouml;glichkeiten:
<ol>
<li>Kategorie: Dient lediglich zur Erh&ouml;hung der &Uuml;bersicht auf der Hompepage/ Infoschool-Startseite.</li>
<li>Titel: Hier sollte man einen m&ouml;glichst aussagekr&auml;ftigen, kurzen Titel eingeben.</li>
<li>Initial: Das Initial erscheint im fertigen Beitrag hervorgehoben am Anfang des Beitrags. Man kann es zum Beispiel f&uuml;r eine Datums- oder Ortsangabe nutzen. (z.B. "<b>&lt;initial&gt;Diepholz, 24. Dezember 2004&lt;/initial&gt;</b> Hier f&auml;ngt der eigentliche Beitrag an")</li>
<li>Mehr-Link: Dieses Textfeld wird als Link interpretiert, welches am Ende des Beitrags erscheint. Alternativ kann man auch das [url]-Tag im Textfeld nutzen.</li>
<li>Infoschool/ Homepage: Durch das setzen eines/ beider H&auml;ckchens legt man fest, wo der News-Beitrag sp&auml;ter erscheint.</li>
<li>Freigabe-Level: Hier hat man die M&ouml;glichkeit den Level des Beitrags zu bestimmen. Damit er sofort sichtbar ist, muss der Level auf 2 gesetzt werden. Man kann als Level jedoch h&ouml;chstens den Level w&auml;hlen, den man vom Administrator zugeteilt bekommen hat (standardm&auml;&szlig;ig 0)!</li>
<li>Status: Der Status dient der internen Verwaltung. Nur Beitr&auml;ge die auf "aktiv" geschaltet wurden, erscheinen auch auf der Startseite/ Homepage.</li>
<li>Datum: Hier kann man noch nachtr&auml;glich das Erscheinungsdatum manipulieren. Normalerweise sollte man diese Option jedoch nicht nutzen, da man dadurch auch die Reihenfolge auf der Startseite beeinflusst.</li>
<li>Text des Eintrags: Hier kann man die eigentliche News eingeben (<a href="faq.php#texte">Regeln zum Erstellen von Texten</a>). In der L&auml;nge sind die Beitr&auml;ge nicht begrenzt, allerdings sollte man beachten, dass es sich um kurze News auf der Startseite handelt und nicht um komplette Artikel.</li>
<li>Kommentar: &Uuml;ber das Kommentarfeld kann man anderen, die die News sp&auml;ter noch bearbeiten oder freischalten, zus&auml;tzliche Informationen geben. Beispielsweise die Bitte, den Beitrag noch auf Rechtsschreibfehler zu korrigieren.</li>
</ol>
</p>