<h1>News</h1>
<h3>Allgemein</h3>
<p>
Das Modul "News" gibt jedem Sch&uuml;ler und Lehrer (also allen die sich bei Infoschool registriert haben) die M&ouml;glichkeit News-Beitr&auml;ge zu verfassen, die dann auf der Schulhomepage und/ oder der Startseite von Infoschool erscheinen. Allerdings m&uuml;ssen diese Beitr&auml;ge zun&auml;chst von einem Administrator (bzw. einem Beauftragten, der die entsprechenden Rechte erhalten hat) freigeschaltet werden, um Mi&szlig;brauch zu verhindern.
</p>
<h3>&Uuml;bersicht</h3>
<p>
 Auf der &Uuml;bersichtsseite, lassen sich alle News-Beitrage anschauen und editieren, auf die man Zugriff hat. Ganz oben befindet sich ein Navigationsformular, &uuml;ber das sich die Auswahl begrenzen l&auml;sst (z.B. wenn nur News angezeigt werden sollen, die auf der Homepage erscheinen).
</p>

<h3>Welche Funktion haben die Level?</h3>
 Die Freigabe-Level ersetzen im Newsmodul die Rechte. Dabei hat jeder Beitrag ein bestimmtes Level (0-2), welches angibt, wer darauf Zugriff hat. News mit dem Level 2 sind zus&auml;tzlich komplett freigeschaltet, d.h. sie sind auf der Startseite und der Homepage sichtbar.<br>
Zus&auml;tzlich sind auch den Nutzern Zugriffslevel zugeordnet, die den Leveln der Beitr&auml;ge entsprechen (also wieder 0-2). Standardm&auml;&szlig;ig hat jeder Nutzer den Level 0, der Systemadministrator kann aber (zum Beispiel einem Lehrern) einen anderen Level zuordnen (1 oder 2).<br>
Die Level haben folgende Auswirkungen:
<ul>
<li>Level 0: Man darf News-Beitr&auml;ge verfassen. Au&szlig;erdem kann man eigene News-Beitr&auml;ge, die bereits einen h&ouml;hren Level haben (1 oder 2) editieren (dadurch werden sie jedoch auf Level 0 zur&uuml;ckgesetzt) und kleinere &Auml;nderungen (ohne Zur&uuml;cksetzung des Levels) vornehmen.</li>
<li>Level 1: Zus&auml;tzlich zu den M&ouml;glichkeiten durch Level 1 kann man das Level eines Beitrags auf 1 setzen und hat Zugriff auf <b>alle</b> (also nicht nur die selbsterstellten) News der Level 0 und 1.</li>
<li>Level 2: Nutzer, denen Level 2 zugeordnet wurden, haben Zugriff auf <b>alle</b> News-Beitr&auml;ge (unabh&auml;ngig vom Level des Beitrags). Sie k&ouml;nnen einen Beitrag auch endg&uuml;ltig freischalten.</li>
</ul>
<h3>Newseintr&auml;ge</h3>
<p>Auf der &Uuml;bersichtsseite hat man die M&ouml;glichkeit kleinere &Auml;nderungen an einem News-Beitrag durchzuf&uuml;hren. Zum Beispiel l&auml;sst sich der Level oder die Kategorie &auml;ndern.<br>
Wenn man den Beitrag selbst editieren will, kommt man mit einem Klick auf "editieren" zu einer entsprechenden Eingabemaske, wo man weitere Einstellungsm&ouml;glichkeiten hat.<br>
Auf der &Uuml;bersichtsseite l&auml;sst sich ein Beitrag au&szlig;erdem komplett l&ouml;schen.
</p>
</p>