<p>
 Diese FAQ soll bisher gestellte Fragen beantworten.<br>
 Ist deine Frage nicht dabei, solltest du sie im Forum "Support" stellen, damit sie jeder lesen und vielleicht auch beantworten kann. Zur &Uuml;bersichtlichkeit werden wichtige Fragen mit ihren Antworten in diese FAQ &uuml;bernommen.
 <ol>
  <li><a href="#faq">Was ist eine FAQ?</a></li>
  <li><a href="#infoschool">Was ist Infoschool?</a></li>
  <li><a href="#intraschool">Hie&szlig; Infoschool nicht fr&uuml;her Intraschool?</a></li>
  <li><a href="#login">Warum steht auf jeder Seite das Gleiche?</a></li>
  <li><a href="#anmeldung">Wie bekomme ich einen Account?</a></li>
  <li><a href="#account-entscheidung">Wer bekommt einen Account?</a></li>
  <li><a href="#passwort_vergessen">Ich habe mein Passwort vergessen. Was nun?</a></li>
  <li><a href="#passwort_neu">Was sollte ich beim Ausw&auml;hlen meines Passworts beachten?</a></li>
  <li><a href="#passwort_hack">Ich vermute, dass jemand mein Passwort erfahren hat und nun meinen Account benutzt!</a></li>
  <li><a href="#cookies">Was haben Kekse (Cookies) mit dieser Seite zu tun?</a></li>
  <li><a href="#einstellungen">Wie &auml;ndere ich meine pers&ouml;nlichen Einstellungen?</a></li>
  <li><a href="#gruppen">Wozu sind &uuml;berhaupt Gruppen da?</a></li>
  <li><a href="#gruppe_alle">Was ist das eigentlich f&uuml;r eine Gruppe "Alle"?</a></li>
  <li><a href="#texte">Was ist beim Erstellen von Texten zu beachten?</a></li>
  <li><a href="#mail">Warum kommen meine Antwortmails nicht an?</a></li>
  <li><a href="#bildschirmschoner">Hat die Seite eigentlich einen Bildschirmschoner?</a></li>
  <li><a href="#vorschau">Wie schicke ich eine Nachricht ab, wenn ich beim Schreiben die Vorschau angeklickt habe?</a></li>
  <li><a href="#zensuren">Wie kann man denn hier seine Zensuren sehen?</a></li>
  <li><a href="#notengeben">Wie funktioniert das Notengeben?</a></li>
  <li><a href="#gruppentermin">Was hat es mit dem Feld hinter "Gruppe" unter "Neuer Termin" aus sich?</a></li>
  <li><a href="#punktesystem">Wie funktioniert das Punktesystem?</a></li>
  <li><a href="#sie">Wieso werde ich gesiezt, obwohl ich noch nicht in der Oberstufe bin?</a></li>
 </ol>
</p>

<a name="faq"><h3>Was ist eine FAQ?</h3></a>
<p>
 FAQ ist die Abk&uuml;rzung f&uuml;r Frequently Asked Questions, was so viel bedeutet wie h&auml;ufig gestellte Fragen.<br>
 In FAQs stehen Fragen zu bestimmten Themen samt Antworten und somit sind sie eine der ersten Anlaufstellen, falls man eine Frage hat.
</p>

<a name="infoschool"><h3>Was ist Infoschool?</h3></a>
<p>
 Infoschool ist ein Web-Projekt, dass in vielen Bereichen der Schule den Informationsaustausch vereinfachen soll.<br>
 So steht ein Terminkalender mit Stunden- und Vertretungsplan, einem Dateiaustausch f&uuml;r Unterrichtsmaterialien, Foren zum Diskutieren und ein Message-System zur Verf&uuml;gung.
</p>

<a name="intraschool"><h3>Hie&szlig; Infoschool nicht fr&uuml;her Intraschool?</h3></a>
<p>
 Ja, das ist richtig. Da der Name Intraschool jedoch bereits von einer Firma verwendet wurde, haben wir uns entschlossen dieses Projekt "Infoschool" zu nennen.
</p>

<a name="login"><h3>Warum steht auf jeder Seite das Gleiche?</h3></a>
<p>
 Wahrscheinlich weil du dich noch nicht eingeloggt hast. In diesem Fall siehst du rechts ein Formular, in das du deinen Namen und dein Passwort eintragen kannst. Klickst du danach auf "Login", bist du entweder "drin" oder bekommst eine R&uuml;ckmeldung warum nicht.<br>
 Wenn du das erste Mal auf dieser Seite bist und noch gar keinen Account hast, dann musst du dich zuerst anmelden (siehe unten).
</p>

<a name="anmeldung"><h3>Wie bekomme ich einen Account?</h3></a>
<p>
 Dazu klicken Sie erstmal auf <a href="../users/person_new_request.php">Antrag stellen</a>, lesen sich dort die Nutzungsbedingungen durch und f&uuml;llen das Formular aus. Danach m&uuml;ssen Sie warten, bis Ihnen per E-Mail mitgeteilt wurde, ob Sie Ihren Account bekommen haben oder nicht.
</p>

<a name="account-entscheidung"><h3>Wer bekommt einen Account?</h3></a>
<p>
 Theoretisch sollen alle an Schule Beteiligten einen Account erhalten, wenn sie es w&uuml;nschen.<br>
 Im Endeffekt entscheiden die Administratoren des Systems (im Regelfall die Schulleitung) &uuml;ber neue Accounts.
</p>

<a name="passwort_vergessen"><h3>Ich habe mein Passwort vergessen. Was nun?</h3></a>
<p>
 Sie klicken auf <a href="../users/passwd_new.php">Passwort vergessen</a> und tragen in das erscheinende Formular Ihren Vor- und Nachnamen ein. Wenn Ihr Name gefunden wurde, generiert das System Ihnen ein neues Passwort und schickt es Ihnen an die E-Mailadresse, die Sie beim Registrieren angegeben haben.<br>
 Das alte Passwort kann man nicht mehr erfahren, weil es nur verschl&uuml;sselt abgespeichert wurde. Nachdem Sie sich mit Ihrem neuen Passwort eingeloggt haben, k&ouml;nnen Sie es nat&uuml;rlich wieder &auml;ndern.
</p>

<a name="passwort_neu"><h3>Was sollte ich beim Ausw&auml;hlen meines Passworts beachten?</h3></a>
<p>
Sie sollten Ihr Passwort regelm&auml;&szlig;ig &auml;ndern - m&ouml;glichst mehrmal im Jahr! Ein sicheres Passwort besteht aus Buchstaben, Zahlen und Sonderzeichen und ist mindestens 6 Zeichen lang. Nicht zu empfehlen sind W&ouml;rter, Namen, Geburtsdaten und &auml;hnliches. Achten Sie auch darauf, dass niemand Ihr Passwort erf&auml;hrt (z.B. durch Zettel auf dem Monitor)! Ansonsten kann sich diese Person mit Ihren Rechten und unter Ihrer Identit&auml;t bei Infoschool einloggen!
</p>

<a name="passwort_hack"><h3>Ich vermute, dass jemand mein Passwort erfahren hat und nun meinen Account benutzt!</h3></a>
<p>
Versuchen Sie sofort Ihr Passwort zu &auml;ndern. Sollte dies im Benutzerprofil nicht mehr m&ouml;glich sein, nutzen Sie bitte die Funktion <a href="../users/passwd_new.php">Passwort vergessen</a> - dann wird Ihnen ein neues Passwort zugeschickt.<br>
In jedem Fall sollten Sie sich m&ouml;glichst schnell an einen Administrator wenden. Dieser kann Ihren Account sperren und m&ouml;glicherweise auch herausfinden, wer Ihren Account mi&szlig;braucht hat!
</p>

<a name="cookies"><h3>Was haben Kekse (Cookies) mit dieser Seite zu tun?</h3></a>
<p>
 Diese Spezialkekse haben die Kreativit&auml;t der Entwickler gef&ouml;rdert. ;-)<br>
 Spa&szlig; bei Seite, Cookie ist der Name f&uuml;r eine kleine Datei auf dem Rechner, in der eine Webseite Informationen speichern und sie wieder auslesen kann.<br>
 Darf jede Webseite auf meiner Festplatte lesen und schreiben?<br>
 Bei den meisten Webbrowsern (z.B. Microsoft Internet Explorer, Mozilla oder w3m) ist diese Cookie-Funktion standardm&auml;&szlig;ig aktiviert und somit darf jede Seite in bestimmten Dateien lesen und schreiben, ja. Normalerweise kann eine Webseite aber nur die Informationen auslesen, die sie auch geschrieben hat.<br>
 Da aber manchmal Sicherheitsl&ouml;cher auftreten, durch die es m&ouml;glich ist, dass auch andere Seiten diese Information lesen k&ouml;nnen, sollte man keine sensiblen Daten (z.B. Passw&ouml;rter im Klartext) in Cookies speichern lassen. Bekommt die falsche Person diese Informationen in die H&auml;nde, ist es nur eine Frage der Zeit (von der Verschl&uuml;sselung abh&auml;ngig) bis sie die Daten missbrauchen kann.<br>
 Diese Seite speichert Passw&ouml;rter grunds&auml;tzlich verschl&uuml;sselt. Solch ein Passwort zu knacken dauert im Normalfall sehr lange. Allerdings ist es auf dieser Seite &uuml;ber Cookies auch m&ouml;glich sich mit dem verschl&uuml;sselten Passwort einzuloggen. Also sollte man auch auf dieses gut aufpassen. Auf einem PC in der Schule sollte man nat&uuml;rlich <b>nie</b> das Passwort in einem Cookie speichern!<br>
 Wenn ihr nicht eingeloggt seid, erscheint rechts der Punkt <a href="../rm_cookies.php?origin=/dokumentation/faq.php&autologin=">Alle Cookies dieser Domain l&ouml;schen</a> (alternativ kann man auch hier drauf klicken).
</p>

<a name="einstellungen"><h3>Wie &auml;ndere ich meine pers&ouml;nlichen Einstellungen?</h3></a>
<p>
Um das Verhalten von Infoschool einzustellen, Ihren pers&ouml;nlichen Steckbrief zu ver&ouml;ffentlichen oder Ihr Passwort zu &auml;ndern, klicken Sie oben rechts auf Ihren eigenen Benutzernamen. Damit gelangen Sie zu einer Seite, wo Sie all diese Einstellungen vornehmen k&ouml;nnen. Sie k&ouml;nen aber auch direkt diesen <a href="../benutzer/view_person.php">Link</a> benutzern.
</p>

<a name="gruppen"><h3>Wozu sind &uuml;berhaupt Gruppen da?</h3></a>
<p>
 Gruppen haben mehrere Funktionen:
 <ol>
  <li>Sie fassen mehrere Personen zusammen. So kann man einer ganzen Personengruppe eine Nachricht schicken, ein Recht an einem Forum geben oder &Auml;hnliches.</li>
  <li>Ist man Mitglied in einer Gruppe, so erscheinen alle Stunden dieser Gruppe im Kalender.</li>
  <li>Hat der Gruppenleiter sein Namensk&uuml;rzel wie im Vertretungsplan angegeben, sollten die Informationen vom Vertretungsplan im Kalender erscheinen (keine Klausuren).</li>
  <li>Ein Gruppenleiter kann seiner Gruppe Zensuren verteilen.</li>
 </ol>
 Wie man alles im einzelnen macht, ist in der <a href='./'>Dokumentation</a> beschrieben.
</p>

<a name="gruppe_alle"><h3>Was ist das eigentlich f&uuml;r eine Gruppe "Alle"?</h3></a>
<p>
 Diese Gruppe wird speziell behandelt. Und zwar werden alle neuen Benutzer gleich dort als Mitglied registriert.<br>
 Sie ist n&uuml;tzlich, wenn man zum Beispiel ein Forum an alle freigeben will. Es w&auml;re so auch m&ouml;glich wichtige Mitteilungen an alle zu verschicken.<br>
 Aber <b>Vorsicht</b>, wenn man Nachrichten sinnlos an alle schickt, dann sind wahrscheinlich sehr viele Leute sauer auf einen.
</p>

<a name="texte"><h3>Was ist beim Erstellen von Texten zu beachten?</h3></a>
<p>
 Normalerweise sollten Texte exakt so dargestellt werden, wie man sie eingibt.<br>
 Oft sind aber auch Elemente zur Textstrukturierung wie <b>fette Darstellung</b> sehr sinnvoll. Deshalb gibt es ein paar Ausnahmen. Dazu benutzt man sogenannte Tags. Die meisten Klammern einen Text ein, der dadurch ver&auml;ndert wird. Die Schreibweise sieht hier so aus:<br>
 [tag]Text[/tag]<br>
 F&uuml;r tag setzt man den Tagnamen ein. Wo man solche Tags benutzen kann, stehen sie &uuml;ber dem Textfeld. Bei aktiviertem JavaScript kann man auf die Tags klicken, damit sie in das Textfeld eingef&uuml;gt werden. Ein Beispiel ist der b-Tag (b: bold: fett):<br>
 "[b]das ist eine fette Sache[/b], das hier nicht mehr"<br>
 Sieht nachher so aus:<br>
 "<b>das ist eine fette Sache</b>, das hier nicht mehr"<br>
 Zur Zeit verf&uuml;gbarer Code:
 <table>
  <tr><th>Tagname</th><th>Angabe</th><th>Auswirkung</th></tr>
  <tr><td>b</td><td>Text</td><td><b>fette Darstellung</b></td></tr>
  <tr><td>i</td></td><td>Text<td><i>kursive Darstellung</i></td></tr>
  <tr><td>u</td></td><td>Text<td><u>unterstrichen</u></td></tr>
  <tr><td>s</td></td><td>Text<td><s>durchgestrichen</u></td></tr>
  <tr><td>strong</td><td>Text</td><td><strong>hervorgehoben</strong></td></tr>
  <tr><td>center</td><td>Element</td><td>mittig</td></tr>
  <tr><td>quote</td><td>Text</td><td>einger&uuml;ckt, andere Farbe</td></tr>
  <tr><td>code</td><td>Code</td><td>anders formatiert</td></tr>
  <tr><td>pre</td><td>Text</td><td>Textformatierung wird &uuml;bernommen</td></tr>
  <tr><td>url</td><td>Adresse</td><td>Darstellung als Hyperlink</td></tr>
  <tr><td>img</td><td>Adresse</td><td>Einbinden als Grafik</td></tr>
 </table>
</p>

<a name="mail"><h3>Warum kommen meine Antwortmails nicht an?</h3></a>
<p>
 Wenn man in den pers&ouml;nlichen Einstellungen das K&auml;stchen hinter "Messages per Mail schicken" ausw&auml;hlt, werden die Mails vom System verschickt.<br>
 Versucht man jetzt direkt per Mail zu antworten, landen die Mails beim Webmaster, von dessen Adresse die vorige Mail geschickt wurde, und nicht bei der Person, die die Nachricht geschickt hat.<br>
 Eine Antwort muss entweder als Message hier auf der Seite verschickt werden oder die E-Mailadresse der anderen Person muss bekannt sein.<br>
 Da sind wir auch schon beim Grund f&uuml;r diesen Umstand, beim Datenschutz. Bei der Anmeldung willigen Personen n&auml;mlich nur ein, dass ihre Personen-Gruppen-Verbindungen innerhalb des Systems ver&ouml;ffentlicht werden, die sie selbst engehen. E-Mailadressen d&uuml;rfen nicht einfach so ver&ouml;ffentlicht werden.
</p>

<a name="bildschirmschoner"><h3>Hat die Seite eigentlich einen Bildschirmschoner?</h3></a>
<p>
 Ja, so in der Art. Mal ganz davon abgesehen, dass moderne Bildschirme nicht mehr durch bewegte Bilder geschont werden m&uuml;ssen (auch Nachbilder bei TFTs kann man wieder ausgleichen), werden Bildschirmschoner inwzischen haupts&auml;chlich zur Unterhaltung benutzt. Da gerade Sch&uuml;ler aus Erfahrung sehr leicht gelangweilt sind, wird so versucht sie bei Laune zu halten.<br>
 Dazu wird beim Laden einer Seite zuf&auml;llig eine Spielerei ausgew&auml;hlt, die nach einer bestimmten Zeit (Standard: 10 min) aktiv wird, solange weder Tasten gedr&uuml;ckt noch die Maus &uuml;ber die Seite bewegt werden. Eventuell hilft es auch die Finger von den Tasten zu lassen, w&auml;hrend ein Lehrer redet (nebenbei lernt man vielleicht auch noch das japanische Alphabet oder kann sich die Punktspiegelung besser vorstellen). Lehrreiche Ideen f&uuml;r die Spielereien sind immer willkommen.<br>
 Die Zeit, nach der die Spielerei aktiv wird, kann man im pers&ouml;nlichen Profil (Name oben Rechts) einstellen. "0" deaktiviert die Spielereien. Zus&auml;tzlich kann man eine Maximalgeschwindigkeit einstellen.
</p>

<a name="vorschau"><h3>Wie schicke ich eine Nachricht ab, wenn ich beim Schreiben die Vorschau angeklickt habe?</h3></a>
<p>
 Du klickst nochmal auf das K&auml;stchen vor Vorschau, sodass dort kein H&auml;ckchen mehr ist, dann auf "Weiter".
</p>

<a name="zensuren"><h3>Wie kann man denn hier seine Zensuren sehen?</h3></a>
<p>
 Solange die Zensuren nicht in die Datenbank eingetragen wurden, kann man sie hier auch nicht sehen.<br>
 Das kann entweder der Gruppeleiter (meist Lehrer) tun, oder man tr&auml;gt sie selbst ein.<br>
 Eine zentrale Datenbank mit allen Zensuren gab es bisher noch nicht. Es liegt nun an den Benutzern sie zu erstellen, wenn sie wollen.
</p>

<a name="notengeben"><h3>Wie funktioniert das Notengeben?</h3></a>
<p>
 Als Gruppenleiter geht man zur Seite der Gruppe (Benutzer, Gruppe Verwalten, Gruppenname) und w&auml;hlt dort den Punkt "Zensuren geben".<br>
 Dort kann man die Art der Note und f&uuml;r jedes Mitglied eine Punktzahl festlegen. Dann noch auf "Vergeben" und fertig.<br>
 Die Punktzahlen wandern in die pers&ouml;nlichen Tabellen der Mitglieder. Jedes Mitglied kann nur seine eigenen Noten einsehen.
</p>

<a name="gruppentermin"><h3>Was hat es mit dem Feld hinter "Gruppe" unter "Neuer Termin" auf sich?</h3></a>
<p>
 Tr&auml;gst du hier einen Namen einer Gruppe ein, wird der Termin allen Gruppenmitgliedern gegeben.<br>
 Du kannst aber nur Gruppen Termine geben, in denen du Mitglied bist.
</p>

<a name="punktesystem"><h3>Wie funktioniert das Punktesystem?</h3></a>
<p>
 In der Oberstufe benutzt man statt der Notenskala (1-6) eine Punkteskala (15-0).<br>
 15 Punkte entspricht dabei einer 1+, 10 Punkte einer 2-, 6 Punkte einer glatten 4 und die ber&uuml;hmte 6 (Ungen&uuml;gend) wird auf den Klausurb&ouml;gen durch 00 P. abgel&ouml;st. Der kritische Kommentar daneben bleibt aber der Gleiche. ;-)
</p>

<a name="sie"><h3>Wieso werde ich gesiezt, obwohl ich noch nicht in der Oberstufe bin?</h3></a>
<p>
 Da Infoschool nicht zwischen Lehrern und Sch&uuml;lern unterscheidet, werden alle Nutzer gesiezt. Wer will, kann sich nat&uuml;rlich auch ein "Du" anstelle des "Sie" denken ;-)
</p>
