<h1>Dateiaustausch</h1>
<h3>&Uuml;bersicht</h3>
<p>
 In einer Tabelle sind alle Ordner, deren Leseberechtigung man hat alphabetisch sortiert.<br>
 Links steht der Name des Ordners und darunter der Name des Besitzers. Mit einem Klick auf den Ordnernamen kann man auf den Inhalt zugreifen (Ordneransicht).<br>
 Rechts ist der Zeitpunkt angegeben, an dem die letzte Datei hochgeladen wurde. Darunter steht der Name desjenigen, der die Datei hochgeladen hat.<br>
Am Ende der Seite findet sich ein Formular &uuml;ber das man einen neuen Ordner anlegen kann.
</p>
<h3>Ordneransicht</h3>
<p>
 Hier sind alle im Ordner vorhandenen Dateien, nach Datum sortiert, aufgelistet.<br>
 Wenn man auch Schreibrechte besitzt, kann man mit dem Link "Datei hinzuf&uuml;gen" eine eigene Datei hochladen.
</p>
<h3>Datei hinzuf&uuml;gen</h3>
<p>
 Durch den Link "Datei hinzuf&uuml;gen" erh&auml;lt meine eine Eingabemaske mit folgenden Feldern:
 <ol>
  <li>Datei: Beim Klick auf den Button "Durchsuchen" &ouml;ffnet sich (je nach Browser) ein Dialog, indem man eine beliebige Datei vom eigenen Computer ausw&auml;hlen kann. Durch einen weiteren Klick auf "Hochladen", wird sie auf den Server &uuml;bertragen. Dies kann, je nach Dateigr&ouml;&szlig;e und Internetverbindung, mehrere Minuten dauern!</li>
  <li>Titel: Hier sollte man eine m&ouml;glichst knappe, treffende Beschreibung w&auml;hlen.</li>
  <li>Dateiname: Standardm&auml;&szlig;ig wird der Dateiname beim Hochladen einer neuen Datei gesetzt, man kann ihn aber auch nachtr&auml;glich noch &auml;ndern. Dabei sollte man beachten, dass die Dateiendung (z.B. ".doc") vorhanden bleibt, da diese prim&auml;r zur Bestimmung des Dateityps genutzt wird. Lediglich bei nicht vorhandenen Dateiendungen versucht Infoschool selber den Dateityp zu ermitteln.</li>
  <li>Beschreibung: Hier hat man die M&ouml;glichkeit die Datei ausf&uuml;hrlich zu beschreiben oder ggf. Arbeitsanweisungen zu geben.</li>
 </ol>
</p>
<h3>Welche Dateien kann ich hochladen?</h3>
<p>
Der Server akzeptier nur Dateien bis zu einer Gr&ouml;&szlig;e von 8 MB, alles was dar&uuml;ber hinausgeht l&auml;sst sich nicht mehr in den Dateiaustausch einbinden. Allerdings haben einige Browser bereits beim Upload kleinerer Dateien Probleme. Au&szlig;erdem sollte man bedenken, dass andere Nutzer m&ouml;glicherweise die Datei mit einem langsamen Modem und nicht &uuml;ber per DSL herunterladen. Deshalb ist es bei gr&ouml;&szlig;eren Dateien (mehr als 5 MB) m&ouml;glicherweise sinnvoll, sie per CD und nicht &uuml;ber den Dateiaustausch zu verteilen.<br>
Ansonsten gibt es keine Einschr&auml;nkungen - alle Dateitypen sind erlaubt.
</p>
<h3>Welche Dateien darf ich hochladen?</h3>
<p>
Infoschool darf selbstverst&auml;ndlich nicht f&uuml;r illegale Inhalte genutzt werden! Dazu geh&ouml;ren auch urheberrechtlich gesch&uuml;tzte Dateien - auch wenn man "nur" ein paar Freunden das Leserecht gegeben hat. Pornographie und anderes nicht-jugendfreies Material sind ebenfalls verboten! Grunds&auml;tzlich ist Infoschool ein Intranet f&uuml;r die <b>Schule</b>. Es wird zwar niemand etwas dagegen haben, wenn man es auch mal f&uuml;r private Dateien nutzt, aber alles was die "normale" Nutzung &uuml;berschreitet (z.B. das Einrichten eines MP3-Archivs) ist nicht erlaubt.<br>
Alle Dateien sind zwar prinzipiell vor dem Zugriff von Lehrerern/ Administratoren (sofern man ihnen nicht ausdr&uuml;cklich Leserechte gegeben hat) gesch&uuml;tzt, aber bei einem begr&uuml;ndetem Verdacht auf Mi&szlig;brauch l&auml;sst sich jeder Datei eindeutig ein Verantwortlicher zuordnen.
</p>