<h1>Einleitung</h1>
<h3>Entstehung</h3>
<p>
 Als mehrere Lehrer sogenannte "virtuelle Klassenr&auml;me" nutzen wollten, fielen an ihnen schnell Nachteile auf:<br>
 <ol>
  <li>Langsamkeit: da die Seiten auf irgendwelchen fremden Servern lagen, waren sie recht langsam.</li>
  <li>Kompatibilit&auml;t: die benutzten virtuellen Klassenr&auml;ume hatten Schwierigkeiten mit unterschiedlichen Browsern. Bei einem Projekt basierte die Darstellung auf JavaScript, ohne das man nur einen leeren Bildschirm sah. Dazu standen wichtige Funktionen nur nach dem Download eines ActiveX-Plugins zur Verf&uuml;gung. Ein anderes Projekt lud einfach nicht oder nervte durch das st&auml;ndige Aufrechterhalten einer Verbindung durch erneutes Laden einer Seite.</li>
  <li>Flexibilit&auml;t: die fremden Projekte konnten nicht ver&auml;ndert werden.</li>
  <li>Einzelne M&auml;ngel: insgesamt gab es viele Kleinigkeiten (z.B. Navigation, &Uuml;bersichtlichkeit), die die Geduld auf die Probe gestellt haben.</li>
 </ol>
 Da kam schnell der Wunsch auf es einfach besser machen zu wollen.<br>
 Entmutigend war damals, dass wir wussten, dass das Projekt kaum vor dem Abitur fertig wird. Also wozu die Arbeit, wenn man es selbst gar nicht nutzen kann?<br>
 Hier kam der Vorschlag der besonderen Lernleistung. Die Chance auf eine kleine Verbesserung des Abiturs (2-3%) war zwar kein gro&szlig;er Antrieb, gab aber den fehlenden Sinn, den man neben dem Spa&szlig; am Basteln, Kreieren und der Herausforderung ein Projekt der Gr&ouml;&szlig;e in Angriff zu nehmen noch braucht.<br>
 Nach dem Sammeln vieler Ideen musste erstmal die Grundstruktur entworfen werden, bevor es dann richtig los ging.<br>
 Als erste Vorversionen online gestellt wurden, kam direkt viel konstruktive Kritik, die das Projekt immer weiter brachte bis im April 2004 die Version 1.0 fertig war.
</p>
<h3>Grundstruktur</h3>
<p>
 Die zentrale Basis des Projektes ist die Datenbank. In dieser sind Personen, Gruppen und deren Zuordnung gespeichert.<br>
 Durch die Gruppen ist es m&ouml;glich die gro&szlig;e Menge an Sch&uuml;lern und Lehrern zu ordnen. Ohne Klassen kann man sich Schule kaum vorstellen.<br>
 In jedem Teilbereich des Projektes wird diese Grundstruktur benutzt: Im Kalender stehen die Stunden, in deren Gruppen man ist; Foren werden bestimmten Gruppen oder Personen mit verschiedenen Rechten zugeordnet; Messages k&ouml;nnen an ganze Gruppen versandt werden und so weiter.<br>
 Dabei sind erstmal alle Personen gleich und erhalten erst sp&auml;ter bestimmte Eigenschaften. Zum Beispiel macht das System keine Unterscheidung zwischen Sch&uuml;lern und Lehrern, aber es ist denkbar diese Gruppen anzulegen.
</p>
<h3>M&ouml;glichkeiten</h3>
<p>
 Nach allgemeinen Erkl&auml;rungen gibt es hier ein paar Beispiele was mit Infoschool m&ouml;glich ist:
 <ul>
  <li>Kalender: Tritt man allen Gruppen bei, in denen man Unterricht hat, werden deren Stunden im Kalender eingetragen. Sind noch nicht alle Gruppen da, kann man sie einfach erstellen.</li>
  <li>Todoliste: &Uuml;ber "Neuer Termin" kann man der Vergesslichkeit vorbeugen und wichtige Sachen festhalten. Wenn es sich um Hausaufgaben handelt, kann man den Termin auch der entsprechenden Gruppe mitgeben. Wie w&auml;re es mit einem Hausaufgabendienst? Lehrer k&ouml;nnen so auch sicher gehen, dass (fast) alle Sch&uuml;ler die Hausaufgaben mitkriegen. Am besten tragen Lehrer sie selber ein.</li>
  <li>Forum: Wenn man pro Kurs oder Klasse ein Forum erstellt, kann dar&uuml;ber diskutiert oder Unterrichtsmaterial ausgetauscht werden. Falls man auch Fragen anderer beantworten will, kann das Forum f&uuml;r alle freigegeben werden.</li>
  <li>Dateiaustausch: Um Dateien anderen Nutzern zug&auml;nglich zu machen, k&ouml;nnen Sie hier eigene Ordner anlegen und dann Ihre Dateien auf den Server laden.</li>
  <li>Messages: Sie kennen die E-Mailadresse einer Person an unserer Schule nicht? &Uuml;ber pers&ouml;nliche Nachrichten kann man jede angemeldete Person erreichen.</li>
  <li>Zensuren: Wenn man hier alle seine Zensuren eintr&auml;gt, wird einem der Durchschnitt von alleine ausgerechnet. Au&szlig;erdem beh&auml;lt man den &Uuml;berblick auch noch, wenn das Zeugnis im Ordner vergraben oder an den Koordinator abgegeben wurde. Lehrer k&ouml;nnen Zensuren auch in den Ferien vergeben, wenn sie in dieser Zeit Klausuren korrigieren oder es verpasst haben die m&uuml;ndlichen Noten mitzuteilen.</li>
  <li>News: &Uuml;ber die News haben Sie die M&ouml;glichkeit Vorschl&auml;ge f&uuml;r News auf der Startseite oder der Schulhomepage zu machen. Diese m&uuml;ssen dann lediglich noch von einem Administrator freigeschaltet werden um allen Nutzern zug&auml;nglich zu sein.</li>
 </ul>
</p>