<h1>Startseite</h1>
<table align="center">
 <tr>
  <td></td>
  <td><h2>&uarr;&nbsp;<a href="#ueberschriften">&Uuml;berschriften</a>&nbsp;&uarr;</h2></td>
  <td></td>
 </tr>
 <tr>
  <td><h2>&larr;<br><a href="#menue">Men&uuml;</a><br>&larr;</h2></td>
  <th><a href="#inhalt">Inhalt</a></th>
  <td><h2>&rarr;<br><a href="#login">Login</a><br>&rarr;</h2></td>
 </tr>
</table>
<p>
 Die Startseite hei&szlig;t den Besucher willkommen und versucht den Sinn der Seite kurz zu erkl&auml;ren.<br>
 Falls man noch nicht eingeloggt ist, weist sie den Weg zu einem neuen Account ("Antrag stellen"). In diesem Fall ist dieser Text auch auf den meisten anderen Seiten zu sehen.<br>
 Ansonsten bietet sie Platz f&uuml;r eventuelle wichtige Mitteilungen oder f&uuml;r die anf&auml;ngliche Orientierung (siehe oben).
</p>
<a name="ueberschriften"><h3>&Uuml;berschriften</h3></a>
<p>Die &Uuml;berschriften dienen auf jeder Seite zur kurzen Orientierung.</p>
<a name="menue"><h3>Men&uuml;</h3></a>
<p>
 Das Navigationsmen&uuml; soll Links zu allen wichtigen Seiten zeigen.<br>
 Mit einem Klick kommt man zum n&auml;chsten Hauptthema. Gibt es von dort aus wieder mehrere Wege, die man einschlagen kann, erscheinen sie einger&uuml;ckt unter ihrem Hauptthema.
</p>
<a name="login"><h3>Login</h3></a>
<p>
 Wichtigste Bestandteile des Loginformulars sind die Textfelder. In diese gibt man Nachnamen sowie Passwort ein und geht dann auf "Login".<br>
 Wenn es mehrere Personen mit dem eigenen Nachnamen gibt, dann muss noch der Vorname angegeben werden.<br>
 Die Option "Speichern" steht nur zur Verf&uuml;gung, wenn der Webbrowser <a href="faq.php#cookies">Cookies</a> akzeptiert. Dann werden die Logindaten auf dem eigenen Computer gespeichert und erscheinen beim n&auml;chsten Besuch automatisch in den Formularfeldern. In dem Fall braucht man sich nicht wundern, wenn die L&auml;nge des Passwortes nicht mit der Anzahl der Sternchen &uuml;bereinstimmt. Dort steht dann das verschl&uuml;sselte Passwort, das immer 16 Zeichen lang ist.<br>
 "Autologin" bewirkt, dass man beim Besuch der Seite automatisch mit den gespeicherten Daten eingeloggt wird.<br>
 Werden die Logindaten gespeichert, erscheint oben rechts neben "Login: " ein rotes Kreuz mit dem man die Logindaten wieder l&ouml;schen kann. Dabei werden allerdings keine Optionen gel&ouml;scht, die man nach dem Login speichern kann (siehe unten).<br>
 Um wirklich alle Cookies dieser Seite zu l&ouml;schen, w&auml;hlt man den Text rechts unten "Alle Cookies dieser Domain l&ouml;schen".
</p>
<h4>Drin!</h4>
<p>
 Ist man eingeloggt, erscheinen hier Informationen &uuml;ber den Account:
 <ol>
  <li>Name: ein Klick f&uuml;hrt zu den Einstellungen.</li>
  <li>Zeitpunkt des letzten Logins: ab dann gelten Posts etc. als neu.</li>
  <li>Logoutlink: sollte vor dem Verlassen der Seite angeklickt werden.</li>
  <li>
   Optionenmen&uuml;:
    <ol>
     <li>Optionen in Cookies speichern: der Pfeil nach rechts (zur Diskette).</li>
     <li>Optionen aus Cookies laden: der Pfeil nach links, passiert bei jedem Login.</li>
     <li>Optionen in Cookies l&ouml;schen: das rote Kreuz.</li>
    </ol>
    Optionen sind zum Beispiel die Einstellungen der Mailansicht oder der Buchstabe in der Personen-/Gruppenansicht.
  </li>
  <li>
   Neuigkeiten: Wenn es neue Messages oder Posts gibt, wird dies in zus&auml;tzlichen K&auml;sten angezeigt. Au&szlig;erdem wird man dort &uuml;ber Antr&auml;ge von Personen informiert, die zum Beispiel in eine Gruppe aufgenommen werden wollen, die man leitet.
  </li>
 </ol>
</p>
<a name="inhalt"><h3>Inhalt</h3></a>
<p>
 Der Inhalt h&auml;ngt immer von der jeweiligen Seite ab. Zus&auml;tzlich ist der Inhalt vieler Seiten auf den eingeloggten Besucher zugeschnitten (z.B. der Kalender). Dieses Verhalten l&auml;sst sich aber in den pers&ouml;nlichen Einstellungen &auml;ndern.<br>
 Nur wenn man nicht eingeloggt ist, steht auf vielen Seiten der Anmeldelink.
</p>